Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །སྐྱེས་བུ་དམ་པ་འདི་ཁོ་བོ་ལ་སྩོལ་ཅིག་དང་ཁོ་བོས་བཀྲུའོ།
en: “Holy Man, give the cloth to me.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་རབ་ཏུ་བྱུང་བ་ནི་བདག་ཉིད་ཀྱིས་བྱ་བར་བསྟན་པའི་ཕྱིར་བརྒྱ་བྱིན་ལ་མ་བྱིན་པར་བདག་ཉིད་ཀྱིས་བཀྲུས་སོ།
en: Then I will wash it.” However, the Bodhisattva wanted to demonstrate the conduct of a renunciant, so he did not give the cloth to Śakra. Instead he washed it himself.

source: །དེ་ལུས་ངལ་ཏེ་ཆད་ནས་རྫིང་ནས་འབྱུང་སྙམ་པ་དང་། བདུད་སྡིག་ཅན་ཕྲག་དོག་གི་ཆོས་དང་ལྡན་པས་རྫིང་བུ་གང་བ་མཐོན་པོ་ཞིག་སྤྲུལ་ཏོ།
en: Afterward the Bodhisattva felt tired and wanted to step out of the pond. However, Māra, the evil one, felt jealous and magically raised the edge of the pond.

source: །རྫིང་དེའི་འགྲམ་ན་ཤིང་སྒྲུབ་བྱེད་ཅེས་བྱ་བ་ཆེན་པོ་ཞིག་ཡོད་དོ།
en: Yet at the side of the pond was a large kakubha tree.

source: །བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་དང་འཐུན་པར་བྱ་བ་དང་། ལྷ་མོ་ལ་ཕན་གདགས་པའི་ཕྱིར་ཤིང་དེའི་ལྷ་མོ་ལ་སྨྲས་པ། ལྷ་མོ་ཤིང་གི་ཡལ་ག་སྨོད་ཅིག །དེས་ཀྱང་ཤིང་ཡལ་ག་སྨད་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་འཇུས་ཏེ་བྱུང་ངོ་།
en: In order to follow the worldly custom and to please the goddess of that tree, the Bodhisattva called out to her, “Listen, goddess, lower one of your branches!” The goddess lowered a branch and, as the Bodhisattva grasped it, he was lifted out of the pond.

source: །བྱུང་ནས་ཀྱང་ཤིང་སྒྲུབ་བྱེད་དེའི་དྲུང་དུ་ཕྱག་དར་ཁྲོད་པ་ཆོས་གོས་སྣམ་སྦྱར་དུ་བྱས་ནས་དྲུབས་ཏེ།
en: Once he was free, he remained under the shade of the kakubha tree, where he sewed the dusty rag into the robes of a monk.

source: དེང་སང་དུའང་དེ་ཕྱག་དར་ཁྲོད་པ་དྲུབས་པ་ཞེས་མིང་དུ་གྲག་གོ།
en: Today this place is still known as “The Sewing of the Dusty Rags.”

source: །དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དེས། ལྷའི་གོས་ངུར་སྨྲིག་གི་ཚོན་དུ་བཙོས་པ་རུང་བ་དགེ་སྦྱོང་གི་ཚུལ་དང་འཐུན་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕུལ་ལོ།
en: At that point a god from the pure realms, who was called Vimalaprabha, offered the Bodhisattva divine fabrics that had been dyed in saffron-red color, as is suitable for a monk.

source: །བྱང་ཆུབ་སེམས་དཔས་ཀྱང་དེ་དག་བླངས་ཏེ། སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་བགོས་ནས་སྤྱོད་ཡུལ་གྱི་གྲོང་དུ་ཕྱོགས་པ་དང་།
en: The Bodhisattva accepted this gift, and the following morning he put on these fabrics, arranged them into a monk’s robes, and went to the nearby village.

source: དེ་ན་ལྷ་རྣམས་ཀྱིས་ལྟེང་རྒྱས་ཀྱི་སྡེ་དཔོན་གྱི་གྲོང་ན་དགའ་བྱེད་ཅེས་བྱ་བའི་གྲོང་མི་ཞིག་ཡོད་པའི་བུ་མོ་ལེགས་སྐྱེས་མ་ལ་ནམ་ཕྱེད་ཙམ་ན་སྨྲས་པ།
en: At midnight the gods announced the following to Sujātā, daughter of the villager Nandika, in the village Senāpati in Urubilvā:

source: ཁྱོད་ཀྱིས་གང་གི་ཕྱིར་མཆོད་སྦྱིན་བྱས་པ་དེ་བརྟུལ་ཞུགས་དེ་ཉམས་འོག་ཏུ་ཆུད་ནས་དེ་ཁ་ཟས་རགས་པ་བཟང་པོ་བཟའ་བར་སེམས་ཀྱིས།
en: “The one for whom you have been making offerings has relaxed his discipline and decided that he will once again eat nourishing and solid food.

source: སྔོན་ཁྱོད་ཀྱིས་བདག་གི་ཟས་ཟོས་ནས་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཤོག་ཤིག་ཅེས་སྨོན་ལམ་བཏབ་པ་གང་ཡིན་པའི་ཁྱོད་ཀྱི་བྱ་བ་དེ་གྱིས་ཤིག །དགེ་སློང་དག་དེ་ནས་གྲོང་མི་དགའ་བྱེད་ཀྱི་བུ་མོ་ལེགས་སྐྱེས་མས་ལྷ་དེ་དག་གི་ཚིག་དེ་ཐོས་ནས་མྱུར་བ་མྱུར་བར་བ་སྟོང་གི་འོ་མ་ལན་བདུན་དུ་སྙིང་ཁུར་བྱས་པ་བཟང་པོ་མཆོག་ཏུ་འགྱུར་བ་སྙིང་པོ་ཅན་བླངས་ཏེ།
en: Previously you made the aspiration, ‘May the Bodhisattva take my food and thereby truly attain perfect and completely unexcelled awakening!’ Now that time has come, so you must do what you ought to be doing.” Monks, as soon as Sujātā, daughter of the villager Nandika, heard these words of the gods, she quickly gathered the milk of a thousand cows. Seven times she skimmed the cream from the milk, until she obtained a thick, strength-giving cream.

source: བླངས་ནས་ཀྱང་འོ་མ་དེ་འབྲས་སར་པ་སར་པ་དག་དང་། ཕྲུ་བ་སར་པར་བླུགས་ནས་ཐབ་སར་བར་བཙུགས་ཏེ། ཁ་ཟས་དེ་སྒྲུབ་བོ།
en: She then poured this cream into a new clay pot, mixed it with the freshest rice, and placed it on a brand-new stove.

source: །དེ་སྒྲུབ་པ་ན་སྔ་ལྟས་འདི་དག་སྣང་སྟེ།
en: As the milk porridge was cooking, various omens manifested.

source: འོ་མ་དེའི་ནང་ན་དཔལ་བེའུ་དང་། བཀྲ་ཤིས་པ་དང་། གཡུང་དྲུང་འཁྱིལ་པ་དང་། པད་མ་དང་། སྡོང་རིས་ལ་སོགས་པ་བཀྲ་ཤིས་རྣམས་སྣང་ངོ་།
en: Within the milk appeared the contours of an endless knot, a simple swastika, an elaborate swastika, a lotus, a vardhamāna, and other auspicious signs.

source: །དེ་ནས་དེས་འདི་སྙམ་དུ་བསམས་ཏེ། ལྟས་འདི་ལྟ་བུ་འདི་དག་སྣང་བ་ལས་ན། བྱང་ཆུབ་སེམས་དཔས་ཟས་ཟོས་ནས་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་དུ་ཐེ་ཙོམ་མེད་དོ་སྙམ་པ་དང་། རྒྱ་མཚོ་པ་ཤེས་ཤིང་ཆོ་ག་ཤེས་པའི་མཚན་མཁན་ཕྱོགས་དེར་ཕྱིན་པར་གྱུར་ནས། དེས་ཀྱང་བདུད་རྩི་འཐོབ་པ་ཉིད་དུ་ལུང་བསྟན་ཏོ། །དེ་ནས་ལེགས་སྐྱེས་མས་ཐུག་པ་དེ་ཚོས་པ་དང་ཐང་ལ་བཞག་སྟེ། མེ་ཏོག་གིས་གཏོར། སྤོས་ཆུས་གཏོར་ནས་གུས་པར་སྟན་བཏིང་སྟེ།
en: Upon seeing this, Sujātā thought to herself, “The appearance of these signs surely means that the Bodhisattva will now take food and obtain unexcelled, perfect, and complete awakening.” At that time a fortuneteller versed in ritual and the art of reading signs came to the village and prophesied that someone would attain immortality there. When Sujātā had finished cooking the porridge, she placed it on the ground where, full of devotion, she had already prepared a seat for the Bodhisattva by scattering flowers and perfumed water.

source: བྲན་མོ་གོང་མ་ཞེས་བྱ་བ་ལ་སྨྲས་པ། གོང་མ་སོང་ལ་བྲམ་ཟེ་བོས་ཤིག །ངས་ནི་འོ་ཐུག་སྦྲང་རྩི་ཅན་འདི་བལྟའོ།
en: She then told one of her servants, a woman named Uttarā, “Uttarā, go and fetch the priest. I will stay here and look after this milk porridge with honey.”

source: །ཇོ་མོ་ལེགས་སོ་ཞེས་དེའི་ལྟར་མཉན་ནས།
en: “Very well, my lady,” answered Uttarā, who then did as she was told.

source: ཤར་ཕྱོགས་ལོགས་སུ་སོང་བ་དང་། དེས་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་ངོ་།
en: She went off in the eastern direction, but there she met only the Bodhisattva.

source: །དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་ལོགས་སུ་སོང་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་ངོ་།
en: She then went south, but there as well she met the Bodhisattva.

source: །དེ་བཞིན་དུ་ནུབ་དང་བྱང་ཕྱོགས་ལོགས་སུ་སོང་ན་ཡང་དེ་དང་དེར་དེས་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་ངོ་།
en: Then she went west and north, but in those places as well she encountered the Bodhisattva.

source: །དེའི་ཚེ་ན་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་གཞན་མུ་སྟེགས་ཅན་ཐམས་ཅད་ཚར་བཅད་པར་གྱུར་པས་འགའ་ཙམ་ཡང་མི་སྣང་ངོ་།
en: At that time some gods from the pure realms had removed all the extremist practitioners, and now none of them were to be found.

source: །དེ་ནས་དེ་སླར་ལོག་སྟེ་ཇོ་མོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When she returned, Uttarā told her mistress what had happened:

source: །གང་དང་གང་དུ་མཆིས་ཀྱང་དེ་དང་དེ་ན་དགེ་སྦྱོང་མཛེས་པ་གདའ་བ་ལས།
en: “Wherever I go, the only person I meet is that beautiful monk.

source: དགེ་སྦྱོང་ངམ་བྲམ་ཟེ་གཞན་ནི་འགའ་ཡང་མི་གདའོ།
en: Other than him, there are no monks or priests!”

source: །ལེགས་སྐྱེས་མས་སྨྲས་པ། དེ་ཉིད་བྲམ་ཟེ་ཡིན་ཏེ།
en: Sujātā said, “He alone is the monk, he alone is the priest!

source: དེའི་ཕྱིར་འདི་བརྩམས་ཀྱིས།
en: It is for his sake that I have prepared this meal.

source: གོང་མ་སོང་ལ་དེ་ཉིད་བོས་ཤིག །
en: Go, Uttarā, and fetch him.”

source: ཇོ་མོ་ལེགས་སོ་ཞེས་སྨྲས་ཏེ། གོང་མ་སོང་ནས་བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་ལེགས་སྐྱེས་མ་ཞེས་བགྱི་བས་སྤྱན་འདྲེན་ཏོ་ཞེས་སྨྲས་སོ།
en: “Very well, my lady,” said Uttarā, and off she went. When she met the Bodhisattva, she bowed at his feet and conveyed Sujātā’s invitation to him.

source: །དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གྲོང་པའི་བུ་མོ་ལེགས་སྐྱེས་མའི་ཁྱིམ་དུ་སོང་སྟེ་སྟན་བཏིང་བ་ལ་འདུག་གོ།
en: Monks, the Bodhisattva then went to the home of the village girl Sujātā, where he sat down at the seat that had been prepared for him.

source: །དགེ་སློང་དག་དེ་ནས་གྲོང་པའི་བུ་མོ་ལེགས་སྐྱེས་མས་འོ་ཐུག་སྦྲང་རྩི་ཅན་གྱིས་གསེར་གྱི་སྣོད་ཆེན་པོ་བཀང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕུལ་ལོ།
en: Monks, the village girl Sujātā then filled a golden vessel with the milk porridge and honey and offered it to the Bodhisattva.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་འདི་སྙམ་དུ་བསམས་ཏེ།
en: The Bodhisattva then had this thought:

source: ལེགས་སྐྱེས་མས་ཁ་ཟས་འདི་ལྟ་བུ་འདི་བྱིན་པ་འདི་བདག་གིས་དེང་ཟོས་ཏེ། ཐེ་ཙོམ་མེད་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་མོ།
en: “Sujātā has offered this food, and if I eat it now, there is no doubt that I shall truly attain perfect and completely unexcelled awakening.” Then the Bodhisattva had his meal.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཟས་དེ་བླངས་ནས་གྲོང་པའི་བུ་མོ་ལེགས་སྐྱེས་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཆེ་ཞེ་གསེར་གྱི་སྣོད་ཆེན་པོ་འདི་ཇི་ལྟར་བྱ།
en: When he was done, he got up and asked Sujātā, “Sister, what should I do with the golden bowl?”

source: དེས་སྨྲས་པ། ཁྱོད་སྣོམས་ཤིག །
en: “Please take it with you,” she replied.

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ཁོ་བོ་ལ་ནི་སྣོད་འདི་ལྟ་བུ་མི་དགོས་སོ།
en: The Bodhisattva told her, “I don’t need this bowl.”

source: །ལེགས་སྐྱེས་མས་སྨྲས་པ། ཅི་དགྱེས་སུ་མཛོད་ཅིག །
en: Sujātā then told him, “Well then, do as you please.

source: བདག་ནི་སྣོད་མ་མཆིས་པར་སུ་ལ་ཡང་ཟས་མི་སྩོལ་ཏོ།
en: But I do not give food to anyone without also giving them a bowl.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཟས་དེ་ཐོགས་ཏེ།
en: So the Bodhisattva took the bowl and left Urubilvā.

source: ལྟེང་རྒྱས་ནས་བྱུང་ནས་དྲོ་ལ་བབ་པ་དང་། ཀླུའི་ཀླུང་ཆུ་བོ་ནཻ་རན་ཛ་ནའི་ངོགས་སུ་སོང་སྟེ།
en: Before noon he arrived at the banks of the Nairañjanā River, the river of nāgas.

source: ཟས་དང་ཆོས་གོས་རྣམས་ཕྱོགས་གཅིག་ཏུ་བཞག་ནས། བྱང་ཆུབ་སེམས་དཔའ་ལུས་བསིལ་བར་བྱ་བའི་ཕྱིར་ཀླུང་ནཻ་རན་ཛ་ནའི་ནང་དུ་ཞུགས་སོ།
en: He put down his bowl and robe and entered the water to refresh himself.

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་ཁྲུས་བྱེད་པའི་ཚེ། ལྷའི་བུ་བརྒྱ་སྟོང་དུ་མ་དག་འདི་ལྟ་སྟེ།
en: Monks, while the Bodhisattva was bathing, several hundred thousand gods came to venerate him.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་ཨ་ག་རུ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་དང་། བྱུག་པ་དག་ཀླུང་དུ་ལྡུགས་ཤིང་ལྷའི་མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་དག་ཀྱང་ཆུའི་ནང་དུ་འཐོར་རོ།
en: They poured divine aloe and sandalwood powder as well as various ointments into the river, and they scattered divine flowers of all colors onto the water.

source: །དེའི་ཚེ་ཀླུང་ཆེན་པོ་ནཻ་རན་ཛ་ན་ལྷའི་སྤོས་རྣམས་དང་། མེ་ཏོག་རྣམས་ཀྱིས་གང་བར་གྱུར་ཏེ་འབབ་བོ།
en: In this way the whole great Nairañjanā River flowed on full of divine perfumes and flowers that rained down.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྤོས་ཆུ་གང་གིས་ཁྲུས་བྱས་པར་གྱུར་པ་དེ་ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་གིས་བླངས་ཏེ་མཆོད་རྟེན་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བའི་ཕྱིར་རང་རང་གི་གནས་སུ་ཁྱེར་རོ།
en: Many trillion gods came to collect the perfumed water that the Bodhisattva had used for bathing. They brought it with them to their own abodes in order to enshrine it in memorials and venerate it.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྐྲ་དང་ཨག་ཚོམ་གང་ཡིན་པ་དེ་དག་ཀྱང་གྲོང་པའི་བུ་མོ་ལེགས་སྐྱེས་མས་བཀྲ་ཤིས་པ་ཡིན་ནོ་སྙམ་ནས།
en: The village girl Sujātā also collected all the hair and the beard of the Bodhisattva.

source: མཆོད་རྟེན་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བའི་ཕྱིར་ཁྱེར་རོ།
en: Thinking that it must be sacred, she took it with her in order to make memorials for veneration.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀླུང་ནས་བྱུང་ནས་འདུག་པར་འདོད་དེ་གླིང་ལ་ལྟའོ།
en: When the Bodhisattva emerged from the river, he wanted to sit down, and so he looked for a suitable place on the riverbank.

source: །དེ་ནས་ཀླུང་ནཻ་རན་ཛ་ནའི་ཀླུའི་བུ་མོ་གང་ཡིན་པ་དེ་སའི་འོག་ནས་བྱུང་སྟེ། ཡིད་ལས་བྱུང་བའི་སེང་གེའི་ཁྲི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕུལ་ནས།
en: Right then, a nāga girl who lived in the Nairañjanā River emerged out of the earth’s surface and offered the Bodhisattva a throne made of jewels.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་འདུག་སྟེ། གྲོང་པའི་བུ་མོ་ལེགས་སྐྱེས་མ་ལ་སྙིང་བརྩེ་བ་ཉེ་བར་བཟུང་ནས། ཇི་ཙམ་དགོས་པར་འོ་ཐུག་སྦྲང་རྩི་ཅན་དེ་འཐུངས་སོ།
en: The Bodhisattva took his seat there and, while he was thinking fondly of the village girl Sujātā, he drank what he needed of the milk porridge made with honey.

source: །འཐུངས་ནས་ཀྱང་གསེར་གྱི་སྣོད་ཆེན་པོ་དེ་ལ་མ་ཆགས་པར་ཆུར་བོར་རོ།
en: When he was done with his meal, he threw the golden bowl into the water without any feelings of attachment.

source: །བོར་མ་ཐག་ཏུ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་མཆོད་པའི་འོས་ཡིན་ནོ་ཞེས་དད་པ་དང་གུས་པ་བསྐྱེད་དེ་བླངས་ནས་རང་གི་གནས་སུ་སོང་ངོ་།
en: As soon as the bowl hit the water, the nāga king Sāgara, full of devotion and great respect, came to fetch the bowl and bring it to his kingdom, thinking, “This is worthy of veneration!”

source: །དེ་ནས་མིག་སྟོང་པ་གྲོང་ཁྱེར་འཇིག་པ་ནམ་མཁའ་ལྡིང་གི་གཟུགས་སུ་སྤྲུལ་ནས་ཁ་རྡོ་རྗེའི་མཆུར་བསྒྱུར་ཏེ།
en: At that point the thousand-eyed Indra, the destroyer of cities, changed into a garuḍa with a diamond beak and attempted to steal the golden bowl from the nāga king Sāgara.

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལས་གསེར་གྱི་སྣོད་ཆེན་པོ་དེ་དབྲོག་ཏུ་བརྒལ་ན་མ་ནུས་ནས་རང་གི་གཟུགས་ཀྱིས་གུས་པར་བྱས་ཏེ།
en: When Indra was unable to do so, he changed into his own form and requested it politely.

source: བསླངས་ནས་མཆོད་རྟེན་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བའི་ཕྱིར་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་སུ་ཁྱེར་རོ།
en: This time he received the bowl, and he brought it back to the Heaven of the Thirty-Three in order to enshrine it in a memorial for the sake of worship.

source: །ཁྱེར་ནས་ཀྱང་སྣོད་ཆེན་པོའི་དགེ་འདུན་གྱི་དུས་སྟོན་བྱས་ཏེ།
en: In this heaven he started a religious festival called The Procession of the Bowl, observed on the days of astrological juncture.

source: དེང་སང་དུའང་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལོ་གཅིག་བཞིན་དུ་སྣོད་ཆེན་པོའི་དུས་སྟོན་བྱེད་དོ།
en: To this day the gods in the Heaven of the Thirty-Three hold an annual Festival of the Bowl.

source: །སེང་གེའི་ཁྲི་དེ་ཡང་ཀླུའི་བུ་མོ་དེ་ཉིད་ཀྱིས་མཆོད་རྟེན་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བའི་ཕྱིར་ཁྱེར་རོ།
en: The nāga girl carried off the magnificent throne in order to make a memorial out of it and venerate it.

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔས་ཟས་རགས་པ་ཟོས་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཀྱི་སྟོབས་དང་། ཤེས་རབ་ཀྱི་སྟོབས་ཀྱིས་སྐད་ཅིག་དེ་ཉིད་ལ་ལུས་ལ་སྔ་མའི་ཁ་དོག་བཟང་པོ་རྒྱས་པ་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་དང་། འོད་འདོམ་གང་བ་ཡང་བྱུང་བར་གྱུར་ཏོ།
en: Monks, due to the strength of the Bodhisattva’s merit and the power of his insight, his body instantaneously changed as soon as he took in solid foods. In one moment his body regained its previous beautiful lotus-like luster. He now manifested the thirty-two and eighty marks of a great being as well as a halo of light, one fathom in diameter, around his body.

source: ལོ་དྲུག་བར་དུ་བརྟུལ་ཞུགས་ཉམས་འོག་ཆུད་བྱས་བཅོམ་ལྡན་བློ་གྲོས་འདི་སྙམ་སེམས།
en: After six years of austerities, the Blessed One thinks,

source: །གལ་ཏེ་བདག་ནི་འདི་ལྟར་རིད་བཞིན་བསམ་གཏན་མངོན་ཤེས་ཡེ་ཤེས་སྟོབས་ལྡན་པ།
en: “I may have the strength of concentration and supernatural knowledge,

source: །ཤིང་གི་རྒྱལ་པོའི་དྲུང་དུ་སོང་སྟེ་ཐམས་ཅད་མཁྱེན་ཉིད་འཚང་རྒྱར་བྱ་ན་ནི།
en: But if I go to the king of trees in order to awaken to omniscience under its branches

source: །དེ་དག་ན་ཡང་བདག་གིས་ཕྱི་མའི་སྐྱེ་བོ་དག་ལ་སྙིང་བརྩེ་མ་བྱས་འགྱུར།
en: While I am this emaciated, that would not be kind toward beings in the future.

source: །བསོད་ནམས་ངན་ངོན་ཙམ་དང་ལྡན་པའི་ལྷ་མི་འདི་དག་ངན་པས་ཡེ་ཤེས་ཚོལ།
en: “Gods and humans with little merit look for wisdom in mistaken ways;

source: །དེ་དག་ལུས་ནི་ཉམ་ཆུང་གྱུར་ན་བདུད་རྩི་འཚང་རྒྱ་བྱེད་པར་མི་ནུས་པས།
en: Being in a weakened state, they are unable to attain nectar-like awakening.

source: །ཁ་ཟས་རགས་པ་དམ་པ་ཟོས་ཏེ་ལུས་ཀྱི་མཐུ་སྟོབས་བསྐྱེད་པ་བྱས་ན་ནི།
en: Yet if I eat solid and excellent food, I will regain my physical strength;

source: །ཤིང་གི་རྒྱལ་པོའི་དྲུང་དུ་སོང་སྟེ་ཐམས་ཅད་མཁྱེན་ཉིད་འཚང་རྒྱར་བྱ་བར་བསམས།
en: Then I can go to the king of trees to attain omniscient awakening under its branches.”

source: །གྲོང་པའི་བུ་མོ་སྔོན་ཆད་སྤྱོད་པ་སྤྱད་པ་ལེགས་སྐྱེས་མ་ཞེས་བྱ་བ་དེ།
en: The village girl Sujātā, who has done much good in the past,

source: །འདྲེན་པ་བརྟུལ་ཞུགས་གྲུབ་པར་ཤོག་ཅེས་དེ་ལྟའི་ཡིད་ཀྱིས་རྟག་ཏུ་མཆོད་སྦྱིན་བྱེད།
en: Continuously makes offerings, thinking, “May this guide complete his discipline!”

source: །དེ་ནི་ལྷ་ཡིས་བསྐུལ་བ་ཐོས་ནས་དེ་ཚེ་འོ་ཐུག་སྦྲང་རྩི་ཅན་བླངས་ཏེ།
en: When she hears the request of the gods, she brings milk porridge with honey;

source: །ཀླུང་གི་འགྲམ་དུ་སོང་ནས་དགའ་བའི་ཡིད་ཀྱིས་ནཻ་རན་ཛ་ནའི་ངོགས་ན་འདུག །བསྐལ་པ་སྟོང་དུ་སྤྱོད་པ་སྤྱད་ཅིང་དབང་པོ་ཞི་ལ་རབ་ཏུ་ཞི་བ་དེ།
en: She goes to the river and happily sits on the banks of the Nairañjanā. For one thousand eons the Bodhisattva practiced discipline, and his faculties are at peace.

source: །ལྷ་དང་ཀླུ་ཡི་ཚོགས་དང་དྲང་སྲོང་དག་གིས་བསྐོར་ཏེ་ནཻ་རན་ཛ་ན་ར་འོངས།
en: He goes to the Nairañjanā surrounded by hosts of gods and nāgas as well as sages;

source: །ཕ་རོལ་བརྒལ་ནས་སེམས་ཅན་སྒྲོལ་བ་བློ་གྲོས་ལྡན་པ་ཁྲུས་བྱར་བསམས་ནས་ནི།
en: He makes the crossing and bathes with thoughts aimed at liberating others.

source: །ཐུབ་པ་དག་པ་དྲི་མེད་འཇིག་རྟེན་སྙིང་བརྩེ་ཕྱིར་ནི་ཀླུང་དུ་ཞུགས་ཏེ་འཁྲུ།
en: The Sage, pure and stainless, washes himself in the river out of love for the world.

source: །བྱེ་བ་ཕྲག་སྟོང་ལྷ་དག་དགའ་བའི་ཡིད་ཀྱིས་སྤོས་རྣམས་དང་ནི་ཕྱེ་མ་དག །ཀླུང་དུ་འཐོར་ཞིང་སེམས་ཅན་དམ་པ་བཀྲུ་བའི་དོན་དུ་ཆུ་ལ་གང་བར་བྱེད།
en: Trillions of gods joyfully descend into the river and infuse the waters With perfumes and scented powders so the Sacred Being can bathe.

source: །བྱང་ཆུབ་སེམས་དཔའ་དྲི་མེད་ངེས་པ་བཀྲུས་ཏེ་ངོགས་ན་འདུག་པར་ཤེས་གྱུར་ནས།
en: When the Stainless Bodhisattva has bathed and rests serene on the shore,

source: །ལྷ་སྟོང་རབ་ཏུ་དགའ་སྟེ་སེམས་ཅན་དག་པ་བཀྲུས་པའི་ཆུ་དེ་མཆོད་ཕྱིར་ཁྱེར།
en: Thousands of gods rejoice and take the bathing water as an object for venerating the Pure Being.

source: །ངུར་སྨྲིག་བཟང་པོ་དྲི་མ་མེད་པའི་གོས་དག་ལྷ་ཡི་བུ་ཡིས་དེ་ལ་བྱིན།
en: A god offers him saffron robes of beautiful stainless cloth;

source: །རུང་བ་དག་དང་ཤམ་ཐབས་བགོས་ནས་བཅོམ་ལྡན་འདས་ནི་ཆུ་ཀླུང་ངོགས་ན་འདུག །ཀླུ་ཡི་བུ་མོ་དགའ་ཞིང་རབ་ཏུ་མགུ་བའི་ཡིད་ཀྱིས་སེང་གེའི་ཁྲི་ཡང་བཤམས།
en: Dressed in these suitable robes, the Blessed One rests on the banks of the river. A nāga girl joyfully and devotedly erects a splendid throne

source: །དེ་ལ་འཇིག་རྟེན་དག་གི་མིག་བྱེད་ཡིད་ཀྱང་རབ་ཏུ་ཞི་བ་དེ་འདུག་ནས།
en: On which the guide of the universe peacefully sits.

source: །བློ་གྲོས་ལྡན་པ་ལེགས་སྐྱེས་མ་དེས་གསེར་གྱི་སྣོད་དུ་ཁ་ཟས་བླུགས་ཏེ་བྱིན།
en: Sujātā fills a golden bowl with food and offers it to the Mindful One;

source: །རྐང་པར་ཕྱག་འཚལ་ནས་ནི་དེ་དག་ཁ་ལོ་སྒྱུར་བ་བདག་གིས་གསོལ་ཞེས་བྱས།
en: She prostrates at his feet, saying joyfully, “Great Guide, please enjoy this!”

source: །བློ་གྲོས་ལྡན་པས་ཇི་ཙམ་དགོས་པར་ཟས་ཀྱང་ཟོས་ནས་སྣོད་ནི་ཆུར་བོར་ཏེ།
en: The Mindful One eats as much as necessary and then throws the bowl in the river;

source: །དེ་ནི་གྲོང་ཁྱེར་འཇིག་པ་ལྷ་ཡི་བླ་མས་བདག་གིས་མཆོད་པར་བྱ་ཞེས་ཁྱེར།
en: The highest god, the destroyer of cities, carries it off, saying, “I will venerate it!”

source: །གང་ཚེ་རྒྱལ་བས་ཁ་ཟས་རགས་པ་དམ་པ་ཟོས་པ་དེ་ཡི་སྐད་ཅིག་ལ།
en: The very moment the Victorious One consumes solid and excellent food,

source: །དེ་ཡི་ལུས་ཀྱི་སྟོབས་དང་གཟི་བརྗིད་དག་དང་དཔལ་ཡང་སྔ་མཁོ་བཞིན་དུ་གནས།
en: His body regains its former strength, magnificence, and splendor.

source: །ལེགས་སྐྱེས་མ་དང་ལྷ་རྣམས་དག་ལ་ཆོས་གཏམ་བྱས་ནས་དོན་ཀྱང་མང་དུ་བྱས།
en: To Sujātā and the gods he offers a teaching that benefits them greatly;

source: །སེང་གེ་ངང་པའི་སྟབས་དང་གླང་པོའི་དབང་པོའི་འགྲོས་ཀྱིས་བྱང་ཆུབ་ཤིང་དྲུང་ཆས། །ནཻ་རན་ཛ་ནའི་ལེའུ་ཞེས་བྱ་བ་སྟེ། བཅྭ་བརྒྱད་པའོ།། །།
en: He, the lion with the bearing of a swan and the gait of the supreme elephant, proceeds to the Bodhi tree. This concludes the eighteenth chapter, on the Nairañjanā River.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཀླུང་ནཻ་རན་ཛ་ནར་ཁྲུས་བྱས་ཏེ། ཟས་ཟོས་ནས་ལུས་ཀྱི་མཐུ་སྟོབས་བསྐྱེད་དེ།
en: Monks, when the Bodhisattva bathed in the Nairañjanā River and enjoyed a meal, his physical strength came back to him.

source: བདུད་ལས་རྣམ་པར་རྒྱལ་བར་བྱ་བའི་ཕྱིར་རྣམ་པ་བཅུ་དྲུག་དང་ལྡན་པའི་ས་ཕྱོགས་ཤིང་གི་རྒྱལ་པོ་བྱང་ཆུབ་ཆེན་པོའི་དྲུང་ག་ལ་བ་དེར་སྐྱེས་བུ་ཆེན་པོའི་སྟབས་གང་ཡིན་པའི་སྟབས་དེས་སོང་སྟེ། མི་བསྐྱོད་པའི་སྟབས་དང་། དབང་པོའི་མཆོད་སྡོང་ལྟ་བུའི་སྟབས་དང་། རིའི་རྒྱལ་པོ་ལྷུན་པོ་ལྟར་ཤིན་ཏུ་བརྟན་པའི་སྟབས་དང་། མི་དངོམ་པ་མ་ཡིན་པའི་སྟབས་དང་། ཡ་ཡོ་མེད་པའི་སྟབས་དང་། འཚེ་བ་མེད་པའི་སྟབས་དང་། རིངས་པ་མ་ཡིན་པའི་སྟབས་དང་། སྡོད་པ་མེད་པའི་སྟབས་དང་། འཁྲུགས་པ་མེད་པའི་སྟབས་དང་། འཁྱོར་པ་མེད་པའི་སྟབས་དང་། འདྲུད་པ་མེད་པའི་སྟབས་དང་། ཞུམ་པ་མེད་པའི་སྟབས་དང་། ཧ་ཅང་མི་སྡོད་པའི་སྟབས་དང་། མི་གཡོས་པའི་སྟབས་དང་། རྟབ་རྟབ་པོ་མེད་པའི་སྟབས་དང་། ཚུལ་དུ་ཤིས་པའི་སྟབས་དང་། དྲི་མ་མེད་པའི་སྟབས་དང་། དགེ་བའི་སྟབས་དང་། ཞེ་སྡང་མེད་པའི་སྟབས་དང་། གཏི་མུག་མེད་པའི་སྟབས་དང་། ཆགས་པ་མེད་པའི་སྟབས་དང་།
en: With a triumphant gait, he now began the walk toward the great Bodhi tree. This tree was the king of trees and was found at a place characterized by sixteen unique features. He walked with the gait of a great being. It was an undisturbed gait, a gait of the nāga Indrayaṣṭi, a steadfast gait, a gait as stable as Mount Meru, the king of mountains. He walked in a straight line without stumbling, not too fast and not too slow, without stomping heavily or dragging his feet. It was a graceful stride, a stainless stride, a beautiful stride, a stride free from anger, a stride free from delusion, and a stride free from attachment.

source: སེང་གེའི་སྟབས་དང་། དད་པའི་རྒྱལ་པོའི་སྟབས་དང་། ཀླུའི་རྒྱལ་པོའི་སྟབས་དང་། སྲེད་མེད་ཀྱི་བུའི་སྟབས་དང་། ས་ལ་མི་རེག་པའི་སྟབས་དང་། རྩིབས་སྟོང་དང་ལྡན་པའི་འཁོར་ལོའི་རི་མོ་ས་ལ་སྣང་བའི་སྟབས་དང་། སོར་མོ་དྲ་བས་འབྲེལ་ཅིང་སེན་མོ་ཟངས་ལྟ་བུའི་སྟབས་དང་། སོ་སྒྲ་འབྱིན་པའི་སྟབས་དང་། རི་རྡོབ་པའི་སྟབས་དང་། མཐོན་དམན་མཉམ་པར་བྱེད་པའི་རྐང་མཐིལ་གྱི་སྟབས་དང་། དྲ་བའི་བར་ནས་འོད་དང་འོད་ཟེར་ཕྱུང་ནས་སེམས་ཅན་ལ་རེག་ན་བདེ་འགྲོར་འགྲོ་བའི་སྟབས་དང་། པད་མ་དྲི་མ་མེད་པ་ལ་གོམ་པ་འདོར་བའི་སྟབས་དང་། སྔོན་དགེ་བ་ལེགས་པར་སྤྱད་པའི་འགྲོས་ཀྱི་སྟབས་དང་། སྔོན་གྱི་སངས་རྒྱས་སེང་གེའི་ཁྲི་ལ་བཞུད་པའི་སྟབས་དང་། རྡོ་རྗེ་ལྟར་བསམ་པ་བརྟན་ཞིང་མི་ཕྱེད་པའི་སྟབས་དང་།
en: It was the stride of a lion, the stride of the king of swans, the stride of the king of elephants, the stride of Nārāyaṇa, the stride that floats above the surface, the stride that leaves an impression of a thousand-spoked wheel on the ground, the stride of he whose fingers are connected through a web and who has copper-colored nails, the stride that makes the earth resound, and the stride that crushes the king of the mountains. He walked with the stride of someone whose feet level off the terrain, be it sloping up or sloping down, the stride that leads sentient beings to happy rebirths through contact with the light rays that emerge from the web between his fingers, the stride that walks upon stainless lotuses, the stride that proceeds from previous wholesome actions, the stride of the previous buddha-lions, and the stride that proceeds from a stable and indestructible diamond-like intention.
